{
  "apiName": "Intercom API",
  "url": "https://developers.intercom.com/",
  "title": "Intercom Developers",
  "content": "InstallationDocsAPI ReferenceDeveloper HubApp StoreSearchCMD+KIntercom for DevelopersIntegrate with Intercom by building apps on the complete AI customer service platform. Create seamless customized experiences in the Intercom Help Desk and Messenger using our APIs and SDKS.Start buildingSee App StoreInstall IntercomOn Web, iOS, Android, and moreMake sure the Messenger is available everywhere your customers are. Customize the UI, configure user interactions, or set up push notifications.Install nowBuild and list an appOffer an integration to Intercom's 25K+ customersBuild an app that helps solve business problems, from AI to reporting. Get started by setting up a free development workspace to test and publish your app.Sign up for freeCreate a custom integrationFor Inbox, Messenger, and accessing dataBuild a solution just for your team on your main Intercom workspace. See what's possible with a Messenger app tutorial or Tickets tutorial.See how it worksJoin the brands who build on IntercomGo to app store\"The Intercom API had everything we needed to go from whiteboard to working app within a week. Plus, the documentation made it dead simple.\"Roger ZurawickiEngineer @ Coda“Integrating with Intercom has increased our product engagement and retention. Within 2 weeks of launch, our app had already been used in over 2,500 conversations.”Nicolas GreniéDeveloper Advocate“Aircall signups through Intercom-referral have increased 5x since we launched our app, and it's already been adopted by hundreds of support and sales teams.”Clement BruneauDirector of Business DevelopmentGuides for developers🎟️ Tickets + GitHub Issues Build an integration using webhooks and the Tickets API to create a GitHub issue when a ticket is created in Intercom.📈 ReportingCreate your own reports from conversation and teammates data using the Intercom API.✉️ Inbox apps for adminsIn Intercom, admins are called teammates. Build an Inbox app for a teammate to log data about a contact.Need help?Get fast, helpful support via chat or in the Intercom Community.Join communitywindow.__staticRouterHydrationData = JSON.parse(\"{\\\"loaderData\\\":{\\\"0\\\":null,\\\"0-6\\\":null},\\\"actionData\\\":null,\\\"errors\\\":null}\");"
}